{"sections":{"main":{"type":"main-page","settings":{}},"1650468539be47a171":{"type":"faq","disabled":true,"blocks":{"1650468539944ce59f-0":{"type":"question","settings":{"title":"Can I cancel my order after I've made a purchase on the website? - You can.","text":"<p>We offer immediate order cancellations up to a limit of 24 hours after purchasing so if you change your mind within that time - send us a message and we'll cancel and refund you in full as soon as we get your request.<\/p>"}},"1650468539944ce59f-1":{"type":"question","settings":{"title":"How can I track my package ?","text":"<p>Once you have placed your order, we will send you a confirmation email to track the status of your orde<\/p><p>Once your order is shipped we will send you another email to confirm you the expected delivery date as well as the link to track your order.<\/p>"}},"97de0f4d-e0a2-411c-b548-a59defb57638":{"type":"question","settings":{"title":"Can I change my order?","text":"<p>We can only change orders that have not been processed for shipping yet. Once your order is under the status \"preparing for shipping\", \"shipping\" or \"delivered\", then we cannot accept any edits to your order.<\/p>"}},"b3c6908d-316a-4eab-9df3-79878dc05dba":{"type":"question","settings":{"title":"Can I exchange an item?","text":"<p>We do accept exchanges and they follow the same conditions as returns<\/p><p>In order to ask for an exchange, please mention that you would like your item to be exchanged with another item when preparing your return with our support.<\/p>"}},"63168212-8cc6-42dc-ae11-2694b9e5ed79":{"type":"question","settings":{"title":"Do you accept returns?","text":"<p>We do accept returns in respect to the following conditions:<\/p><p>- The item must have been sold on our online store<br\/>- The item shouldn't have been used in any way<br\/>- The return or exchange request is made within 7 days of delivery<br\/>- The return is made within 14 days of the return or exchange request<\/p>"}},"2264ef93-08bb-49cc-8c67-820f721869d5":{"type":"question","settings":{"title":"Are returns free?","text":"<p>No, buyer from the US or outside of the US pays shipping cost. You can refer to the delivery paper within your package to perform organize your return.<\/p>"}},"213dd747-e166-420c-82a3-04428b680a65":{"type":"question","settings":{"title":"Does gold plated have real gold ?","text":"<p>Yes, all our gold plated jewelry is metal copper based with a thin layer of real 14K gold or 18K gold. Do not treat is as real gold as the product can be damaged since it is not solid gold!<\/p>"}},"aca6c8cc-d354-463b-a5c4-534de75e6dfe":{"type":"question","settings":{"title":"What's the difference with gold plated and gold filled?","text":"<p>Gold filled jewelry has 100x more gold alloy than gold plated and because that layer is so much thicker, it means gold-filled jewelry lasts longer and stands up to wear and tear better than gold plated.<\/p>"}},"655033a4-0f81-49eb-9814-ec8866b49879":{"type":"question","settings":{"title":"Does it turn green or will it tarnish?","text":"<p>No, if it's properly taken care of. Here's some tips to have a long lasting jewelry.<\/p><p>1. Clean your jewelry regularly to remove dirt, liquids, lotions or soap particles which might cling to the jewelry and lead to oxidation against the skin.<\/p><p>2. Don’t swim with your jewelry on as chlorine and copper produce an intense reaction against your skin.<\/p><p>3. Remove your jewelry when cleaning. Standard cleaning supplies also contain chlorine which can cause discoloration when wearing gold jewelry.<\/p><p>4. Intermittently remove jewelry items to<span style=\"text-decoration:underline\">alleviate skin discoloratio<\/span>n and<span style=\"text-decoration:underline\">give your skin a chance to breathe.<\/span><\/p>"}}},"block_order":["1650468539944ce59f-0","1650468539944ce59f-1","97de0f4d-e0a2-411c-b548-a59defb57638","b3c6908d-316a-4eab-9df3-79878dc05dba","63168212-8cc6-42dc-ae11-2694b9e5ed79","2264ef93-08bb-49cc-8c67-820f721869d5","213dd747-e166-420c-82a3-04428b680a65","aca6c8cc-d354-463b-a5c4-534de75e6dfe","655033a4-0f81-49eb-9814-ec8866b49879"],"settings":{"title":""}}},"order":["main","1650468539be47a171"]}